[
  {
    "id": 1,
    "code": "1",
    "title": "การจัดการระบบด้านยา",
    "dimension": "Management",
    "goal": "โรงพยาบาลมีการกำหนดนโยบาย จัดสรรงบประมาณและทรัพยากร และติดตามสนับสนุน การพัฒนาระบบการด้านยาที่ปลอดภัย เหมาะสม และมีประสิทธิภาพ...",
    "levels": [
      {
        "level": 0,
        "description": "ยังไม่ได้ดำเนินการเชิงระบบใด ๆ เพื่อการพัฒนาการจัดการระบบด้านยา",
        "criteria": []
      },
      {
        "level": 1,
        "description": "เริ่มการดำเนินการวางแผน วางโครงสร้างเบื้องต้น",
        "criteria": [
          {
            "id": "1-1-1",
            "text": "ดำเนินการจัดการระบบความปลอดภัยด้านยาในโรงพยาบาล เช่น จัดทำนโยบาย กำหนดโครงสร้างที่เกี่ยวข้อง"
          },
          {
            "id": "1-1-2",
            "text": "จัดตั้งคณะกรรมการเภสัชกรรมและการบำบัด (PTC) ของโรงพยาบาล ซึ่งประกอบด้วยสหสาขาวิชาชีพ"
          }
        ]
      },
      {
        "level": 2,
        "description": "เริ่มการดำเนินการบางส่วน เริ่มเรียนรู้การดำเนินการ",
        "criteria": [
          {
            "id": "1-2-1",
            "text": "PTC มีการประชุมสม่ำเสมออย่างน้อยปีละ 2 ครั้ง และมีกำหนดช่องทางการสื่อสารนโยบายลงสู่ผู้ปฏิบัติ"
          },
          {
            "id": "1-2-2",
            "text": "มีนโยบายในเรื่องคุณภาพและความปลอดภัยด้านยาของโรงพยาบาลที่เป็นลายลักษณ์อักษร"
          },
          {
            "id": "1-2-3",
            "text": "มีแผนการดำเนินงานที่ตอบสนองนโยบายด้านคุณภาพและความปลอดภัยด้านยาของโรงพยาบาล และกำหนดเป้าหมายและตัวชี้วัดระบบยา"
          },
          {
            "id": "1-2-4",
            "text": "มีระบบคุณภาพและความปลอดภัยด้านยาที่สอดคล้องกับนโยบายของโรงพยาบาลข้างต้น เช่น ระบบเพื่อป้องกันความคลาดเคลื่อนทางยา, ระบบป้องกันเหตุการณ์อันไม่พึงประสงค์จากยา, ระบบตรวจสอบการแพ้ยา/อันตรกริยาของยา"
          }
        ]
      },
      {
        "level": 3,
        "description": "ได้ดำเนินการในตัวชี้วัดนั้นแล้ว งานแล้วเสร็จ บางส่วนยังดำเนินการ",
        "criteria": [
          {
            "id": "1-3-1",
            "text": "จัดทำคู่มือ/ แนวทางปฏิบัติความปลอดภัยด้านยาเพื่อความปลอดภัยของผู้ป่วยที่สอดคล้องกับระบบในข้อ 2 และถ่ายทอดเพื่อสร้างความตระหนัก"
          },
          {
            "id": "1-3-2",
            "text": "ติดตาม ดำเนินการ รวบรวมข้อมูลตัวชี้วัดที่กำหนดไว้จากทุกหน่วยงานที่เกี่ยวข้อง"
          },
          {
            "id": "1-3-3",
            "text": "วิเคราะห์ข้อมูล และนำเสนอข้อมูลตัวชี้วัดสำคัญ เช่น ME/ADE คุณภาพยา การใช้ยาสมเหตุผล ฯลฯ ประกอบการพิจารณา"
          },
          {
            "id": "1-3-4",
            "text": "มีแผนการจัดการด้านยาในสถานการณ์ฉุกเฉิน ที่สอดคล้องกับบริบทของพื้นที่"
          }
        ]
      },
      {
        "level": 4,
        "description": "ได้ดำเนินการในตัวชี้วัดแล้วเสร็จ ยังมีความท้าทายด้านความยั่งยืน",
        "criteria": [
          {
            "id": "1-4-1",
            "text": "มีรายงานสถานการณ์ความปลอดภัยด้านยา และผลการดำเนินการของระบบคุณภาพและความปลอดภัยด้านยาอย่างสม่ำเสมอ (อย่างน้อยทุกสามเดือน)"
          },
          {
            "id": "1-4-2",
            "text": "มีการพัฒนาระบบคุณภาพเพื่อความปลอดภัยด้านยาของโรงพยาบาลอย่างต่อเนื่อง โดยใช้ข้อมูลจากรายงานการดำเนินการข้างต้น"
          },
          {
            "id": "1-4-3",
            "text": "สามารถชี้นำ ประสานสหสาขาวิชาชีพ ให้เกิดการขับเคลื่อนการพัฒนาระบบยาไปสู่เป้าหมายที่กำหนดได้"
          },
          {
            "id": "1-4-4",
            "text": "ได้รับการจัดสรรงบประมาณ ทรัพยากร และกำลังคน เพื่อการพัฒนาระบบคุณภาพและความปลอดภัยด้านยาอย่างต่อเนื่อง"
          },
          {
            "id": "1-4-5",
            "text": "มีระบบการจัดการด้านยาในสถานการณ์ฉุกเฉินที่ได้รับการทดสอบ และพร้อมใช้งาน"
          }
        ]
      },
      {
        "level": 5,
        "description": "ระบบมีการดำเนินการอย่างยั่งยืน สามารถเป็นตัวอย่างการเรียนรู้",
        "criteria": [
          {
            "id": "1-5-1",
            "text": "มีการขยายระบบการจัดการด้านยาไปสู่โรงพยาบาลในเครือข่าย"
          },
          {
            "id": "1-5-2",
            "text": "มีการประเมินบทบาทหน้าที่ของ PTC และกรรมการที่เกี่ยวข้อง ในด้านชี้นำ สนับสนุน และติดตาม อย่างสม่ำเสมอ"
          },
          {
            "id": "1-5-3",
            "text": "มีนวัตกรรมทางการบริหารจัดการที่เกิดจากการเรียนรู้ปัญหา นำมาสู่การพัฒนาระบบยาเพื่อความปลอดภัย ที่เป็นต้นแบบได้"
          },
          {
            "id": "1-5-4",
            "text": "เกิดวัฒนธรรมองค์กรด้านความปลอดภัยด้านยา (Safety Culture) ที่มั่นใจได้ว่าโรงพยาบาลมุ่งพัฒนาความปลอดภัย"
          },
          {
            "id": "1-5-5",
            "text": "ไม่เกิดปัญหาจากการใช้ยาที่เกิดจากความคลาดเคลื่อนทางยาที่ป้องกันได้ และไม่ทำให้ผู้ป่วยเสียชีวิตในรอบ 2 ปีที่ผ่านมา"
          },
          {
            "id": "1-5-6",
            "text": "มีการประเมิน Cost effectiveness / Hospitalize rate เพื่อนำไปสู่การตัดสินใจเชิงนโยบาย"
          }
        ]
      }
    ]
  }
]
